Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Закупки.Записывать = Истина;

	Для Каждого Стр Из Товары Цикл

		Если Не ЗначениеЗаполнено(Стр.Товар) Или Стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		// Приход на склад
		ДвОстатки = Движения.ОстаткиТоваров.Добавить();
		ДвОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвОстатки.Период = Дата;
		ДвОстатки.Товар = Стр.Товар;
		ДвОстатки.Количество = Стр.Количество;

		// Оборот закупки: затраты
		ДвЗакупки = Движения.Закупки.Добавить();
		ДвЗакупки.Период = Дата;
		ДвЗакупки.Товар = Стр.Товар;
		ДвЗакупки.Количество = Стр.Количество;
		ДвЗакупки.Сумма = Стр.Сумма;

	КонецЦикла;

КонецПроцедуры
